In [1]:
import pandas as pd 
import sqlite3

In [3]:
df = pd.read_csv('kz.csv')
df.head()

,event_time,order_id,product_id,category_id,category_code,brand,price,user_id
0,2020-04-24 11:50:39 UTC,2294359932054536986,1515966223509089906,2.268105e+18,electronics.tablet,samsung,162.01,1.515916e+18
1,2020-04-24 11:50:39 UTC,2294359932054536986,1515966223509089906,2.268105e+18,electronics.tablet,samsung,162.01,1.515916e+18
2,2020-04-24 14:37:43 UTC,2294444024058086220,2273948319057183658,2.268105e+18,electronics.audio.headphone,huawei,77.52,1.515916e+18
3,2020-04-24 14:37:43 UTC,2294444024058086220,2273948319057183658,2.268105e+18,electronics.audio.headphone,huawei,77.52,1.515916e+18
4,2020-04-24 19:16:21 UTC,2294584263154074236,2273948316817424439,2.268105e+18,NaN,karcher,217.57,1.515916e+18

In [4]:
connection = sqlite3.connect('C:/Users/alqai/OneDrive/Desktop/lite database/Ecommerce/checkouts.db')

In [5]:
cursor = connection.cursor()

In [6]:
df.to_sql(
name = 'checkout', 
con = connection, 
if_exists = 'replace', 
index = False, 
dtype = {'event_time':'real',
        'order_id': 'real',
        'product_id':'text', 
        'category_id':'real', 
        'category_code':'text',
        'brand':'text', 
        'price':'real', 
        'user_id': 'real'})

In [7]:
connection.commit()

In [8]:
connection.close()

In [11]:
connection = sqlite3.connect('checkouts.db')

In [12]:
cursor = connection.cursor()

In [19]:
q1 = "SELECT * FROM sqlite_master WHERE type='table';"

#execute the query and read it in pandas, this returns a table in pandas form
database_info = pd.read_sql_query(q1, connection)
database_info

Empty DataFrame
Columns: [type, name, tbl_name, rootpage, sql]
Index: []